# PANDAS INTRODUCTION
Pandas is a python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to bothe "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

## 1. Importing Pandas
- Pandas are globally imported as pd example (import pandas as pd)
- Pandas are also read as data = pd.read_csv('Enter the path of the excel or any file you want to work on')
- Then you can continue working on the Pandas

In [4]:
# Importing Pandas
import pandas as pd
'''data = pd.read_csv('')'''

"data = pd.read_csv('')"

# 2. Pandas Series
Series in Pandas DataFrame is just another important data structure of pandas.
In most of our data science projects, we'll be working with the pandas data frames.
But in this just little video, I just want to give a small introduction about what is series.

## What is series
A Pandas series is like a column in a table.

It is a one-dimensional array holding data of any type

### Sample Code for Pandas series

In [9]:
#Entering a list of numbers
a = [1, 7, 6, 9]

In [10]:
# Naming a new pandas series called atung
atung = pd.Series(a)

In [8]:
print(atung)

0    1
1    7
2    6
3    9
dtype: int64

### Key/Value Objects as Series
We can also store key value objects as series

In [11]:
#Example of a key value objects as Pandas series with Dictionary
weeks = {"Wk1": 120, "Wk2": 130, "Wk3": 130}

In [12]:
atung = pd.Series(weeks)

In [17]:
print(atung) # or just type: atung to print

Wk1    120
Wk2    130
Wk3    130
dtype: int64

### Practical implementation of Pandas Series

In [14]:
# Let's make a python list
l1 = [3,6,4,8,6,2]

In [15]:
s1 = pd.Series(l1)

In [16]:
s1 #or we can print s1

0    3
1    6
2    4
3    8
4    6
5    2
dtype: int64

### Key series Objects using dictionary
Using dictionary objects for pandas series

In [18]:
 #Another example using dictionary we have
d1 = {"One": 10, "Two": 100, "Three": 1000}

In [19]:
s2 = pd.Series(d1)

In [20]:
s2

One        10
Two       100
Three    1000
dtype: int64

# 3. Pandas DataFrame
### What is a DataFrame?
A Pandas DataFrame is a two dimensional data structure, like two dimensional array, or a table with rows and columns

#### Sample Code of DataFrame
Making our own dataset

In [38]:
data = {
"Names": ['Sam', 'Phil', 'Jane', 'Abo', 'Tani'],
"Calories": [420,380,390,400,410],
"Duration": [50,40,45,55,60]
}

In [39]:
df = pd.DataFrame(data)

In [40]:
df

  Names  Calories  Duration
0   Sam       420        50
1  Phil       380        40
2  Jane       390        45
3   Abo       400        55
4  Tani       410        60

### How to locate a row in Pandas
DataFrame is like a table with rows and columns.

To locate a row, pandas uses loc attribute to return one or more specified row(s)

In [56]:
#Example, locate index 0
print(df.loc[0]) # and to locate multiple index let's say 0 to 2 we we print(df.loc[0:2])
#or we just write df.loc[0]

Weekdays      Sunday
Test Score        10
Name: 0, dtype: object

#### Practical of DataFrame

In [57]:
sample_data = {
    "Weekdays": ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'],
    "Test Score": [10,20,30,35,25,15,30]
}

In [58]:
df = pd.DataFrame(sample_data)

In [59]:
df

    Weekdays  Test Score
0     Sunday          10
1     Monday          20
2    Tuesday          30
3  Wednesday          35
4   Thursday          25
5     Friday          15
6   Saturday          30

In [60]:
# To locate any location let's say index 0 we write
df.loc[0]

Weekdays      Sunday
Test Score        10
Name: 0, dtype: object

# 4. Read CSV Files
A simple way to store big data sets is to use CSV files (comma separated files).
CSV files contains plain tex and is a well known format that can be read by everyone including Pandas.

In [62]:
df = pd.read_csv('cleaned-loan.csv')

In [63]:
df

,Unnamed: 0,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,1,0.0,0.0,1.0,0.0,5849,0.0,146.412162,360.0,1.0,2.0,1.0
1,1,1,1.0,1.0,1.0,0.0,4583,1508.0,128.000000,360.0,1.0,0.0,0.0
2,2,1,1.0,0.0,1.0,1.0,3000,0.0,66.000000,360.0,1.0,2.0,1.0
3,3,1,1.0,0.0,0.0,0.0,2583,2358.0,120.000000,360.0,1.0,2.0,1.0
4,4,1,0.0,0.0,1.0,0.0,6000,0.0,141.000000,360.0,1.0,2.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,609,0,0.0,0.0,1.0,0.0,2900,0.0,71.000000,360.0,1.0,0.0,1.0
610,610,1,1.0,3.0,1.0,0.0,4106,0.0,40.000000,180.0,1.0,0.0,1.0
611,611,1,1.0,1.0,1.0,0.0,8072,240.0,253.000000,360.0,1.0,2.0,1.0
612,612,1,1.0,2.0,1.0,0.0,7583,0.0,187.000000,360.0,1.0,2.0,1.0
613,613,0,0.0,0.0,1.0,1.0,4583,0.0,133.000000,360.0,0.0,1.0,0.0